[{
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_10077105471131887559%22%7D&n_type=1&p_from=4",
    "main_text": "作为“抗击新冠肺炎疫情先进民营企业”的一员，2020年年初，江苏阳光集团在疫情爆发后第一时间转产防护服，并进一步提升防护安全等级攻坚医用防护服项目，为一线“抗疫”人员保驾护航",
    "title": "全国工商联通报表扬抗疫先进民营企业，江苏阳光集团在列",
    "label": "时政",
    "id": 19222
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_9739644341558766562%22%7D&n_type=1&p_from=4",
    "main_text": "大连火车站发布公告乘火车离连需持核酸检测阴性证明根据大连市统筹推进新冠肺炎疫情防控和经济社会发展工作指挥部疫情防控工作要求，即日起，确需乘火车离连的旅客，须持有7日内核酸检测阴性证明，无法提供相关证明的，无法进站乘车。现对广大群众提出如下疫情防控建议：一、有辽宁省大连市金普新区上述中风险旅行居住史，特别是12月8日以来到过大连市金普新区上述中风险地区的人员，请主动拨打我省各级疾控中心咨询热线，主动配合当地政府相关防控措施",
    "title": "湖北疾控再发紧急提示",
    "label": "时政",
    "id": 14388
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_9226240241659678920%22%7D&n_type=1&p_from=4",
    "main_text": "（原标题：心酸！为给孩子买圣诞礼物，美国一单身父亲复工后感染新冠死亡）来源：综合自@环球网、中国日报网流程编辑：TF016。据美媒报道，一位名叫Abraham Amezcua的59岁单身父亲是洛杉矶港口的一名码头工人，今年三月因疫情停止工作。疫情发生以来，中国政府始终把人民群众生命安全和身体健康放在第一位，民众响应号召坚持佩戴口罩、保持社交距离，有关部门对发现感染病例的地区应检尽检。为了给孩子准备圣诞礼物，他在今年11月底复工，但不幸感染新冠",
    "title": "为给孩子买圣诞礼物，美国一单身父亲感染新冠死亡，网友：太可怜了",
    "label": "时政",
    "id": 2254
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_10710519195074379596%22%7D&n_type=1&p_from=4",
    "main_text": "国内疫情死灰复燃，但目前基本可控，19日大连新增确诊病例1例，除了该病例为本土病例外，当天其余22例新增病例均未境外输入，死亡和疑似病例无新增。疫情防控面临新的风险，但也不必过度恐慌，国内疫情的防控体系趋于完善，基本上可以确保不会再次大爆发，目前最大的挑战还是外放输入以及人物传染，冷链运输中发现的病毒阳性已经得到了足够的重视，这也给国内相对安全的防疫环境提供了又一层保障",
    "title": "张伯礼发出警示：春节尽量别回家",
    "label": "时政",
    "id": 8821
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_10743234373295659393%22%7D&n_type=1&p_from=4",
    "main_text": "图/图虫紧急通报！沈阳立即进入战时状态 沈阳市新型冠状病毒肺炎疫情防控指挥部疫情防控组12月23日发布“关于我市发现一例韩国返沈人员解除隔离后核酸检测阳性的情况通报”。根据方案，第一步主要针对部分重点人群，包括从事进口冷链、口岸检疫、船舶引航、航空空勤、生鲜市场、公共交通、医疗疾控等感染风险比较高的工作人员，以及前往中高风险国家或者地区去工作或者学习的人员，尽力缓解输入性疫情防控的压力，降低本土病例发生和国内疫情暴发的风险;第二步，随着疫苗获批上市，或疫苗产量逐步提高，将会有更多的疫苗投入使用，通过有序开展预防接种，符合条件的群众都能实现应接尽接，逐步构筑起人群的免疫屏障，来阻断新冠病毒在国内的传播。现将1例韩国返沈人员解除隔离后新冠病毒核酸检测阳性患者的有关情况通报如下：一、患者基本情况尹某某，女，67岁，中国籍，家庭住址：沈阳市于洪区北陵街道宏达社区，无业。购物消费商场、超市、集贸市场等场所，应限制瞬时客流量，推荐顾客自助购物结算，有效缩短排队等候时间；鼓励采取线上营销、无接触式配送等模式，分流线下人员聚集压力；要严格落实各项防控措施，对场所内经常接触的公共用品和设施要做好清洁消毒，保持室内通风换气，设置“一米线”，督促要求服务人员、顾客佩戴口罩，保持安全距离；落实体温检测、“健康通行码”查验等措施。交通运输机场、车站、码头等重点场所要严格落实通风、消毒、卫生清洁等防控措施，做好进出人员体温检测、“健康通行码”查验，加强客流班次调控，减少等待排队时间，切实降低人员密度；严格落实工作人员和司机每日健康检测制度，上岗前和下班后分别开展体温检测，身体不适的应及时就诊，上岗期间规范防护。文旅活动各类联欢会、音乐会一律采取录播形式举行，录播期间要合理确定现场观众人数，严格落实防控措施；剧院等演出场所观众人数原则上不得超过座位数的75%，上网服务场所、歌舞娱乐场所、游艺娱乐场所接纳消费者人数原则上不得超过核定人数的75%；中、高风险地区，暂停举办营业性演出活动、暂停营业各类文化经营场所；旅游景区要分类完善疫情防控应急预案，做好清洁消毒和公共卫生，按照“能约尽约”的原则，推进预约常态化",
    "title": "突发！沈阳立即进入战时状态，钟南山：中国第一批疫苗要公布了",
    "label": "时政",
    "id": 916
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_10266957053049729934%22%7D&n_type=1&p_from=4",
    "main_text": "最近两天，英国出现变异病毒株，其传染力提升70%以上，令全世界担心不已；而进入12月，黑龙江、成都、大连等多地出现了本土疫情，而11月天津、上海、新疆、内蒙古等地也陆续出现本土疫情……疫情接二连三，似乎又有抬头的趋势，那么，春节会不会封城封村，拜年还有希望吗。而我国一直严防境外输入，英国出现了变异的新冠病毒，国家海关相信会更加严控，隔离防护还会升级，相信，不会给中国带来多大的影响。最近几天，大连连续出现新增病例，分别是18-20日，每天1例，21日，新增本土病例2例，而22日再次新增1例，从这个数字也可以看出，并没有超级传播的感染源，所以，我们相信很快就能得到控制",
    "title": "疫情接二连三，似乎又有抬头的趋势，那么春节拜年还有希望吗？",
    "label": "时政",
    "id": 7789
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_10048037652117275904%22%7D&n_type=1&p_from=3",
    "main_text": "江西.宜春2021明月山富硒温泉越野挑战赛 延期公告各位尊敬的明月山富硒温泉越野挑战赛参赛选手,2021明月山富硒温泉越野挑战赛赛事组委会接到赛事举办地政府相关部门通知：由于新冠肺炎秋冬疫情防控形势和国家疫情防控的工作部署，原定于2021年1月2日举行的2021明月山富硒温泉越野挑战赛需延期至2021年3月21日举行",
    "title": "延期公告｜2021明月山富硒温泉越野挑战赛延期公告",
    "label": "时政",
    "id": 414
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_9576489778215029358%22%7D&n_type=1&p_from=3",
    "main_text": "本来美国的疫情就十分严重，英国人大量涌入，无疑加剧了变异病毒的在全球扩散的风险。当前，新冠疫情仍在全球蔓延，且在西方呈现“井喷”的趋势。截止目前，全球累计确诊新冠肺炎病例7827多万例，累计死亡病例超过172万例。作为全球疫情“震中”，美国哀鸿遍野，累计确诊病例高达1863万例，死亡人数已经超过33万人",
    "title": "约翰逊宣布封城 英国政客说了不该说的话 中方：其心可诛",
    "label": "时政",
    "id": 1820
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_10591769972086825387%22%7D&n_type=1&p_from=3",
    "main_text": "阳发现一例韩国返沈人员解除隔离后核酸检测阳性据沈阳市卫健委通报，1例韩国返沈人员解除隔离后新冠检测阳性，该名患者，尹某某，女，67岁，中国籍，家庭住址：沈阳市于洪区北陵街道宏达社区，无业。9日后，即12月22日20时，该患到中医大一院发热门诊就诊，12月23日2时40分，医院将其诊断为疑似病例后再由市疾控中心采样标检测，结果呈阳性",
    "title": "返沈人员隔离期满后9天呈阳性",
    "label": "时政",
    "id": 13348
}, {
    "url": "https://mbd.baidu.com/newspage/data/landingsuper?context=%7B%22nid%22%3A%22news_10732052662206842854%22%7D&n_type=1&p_from=4",
    "main_text": "财联社（上海，编辑 史正丞）讯，截至北京时间12月23日23点20分，全球新冠肺炎确诊病例上升至78174164例，其中死亡病例达到1720366例。以下为相关国家每日确诊病例的增长曲线：（来源：财联社、Wind）全球疫情动态【钟南山：中国第一批疫苗要公布了】据媒体周三报道，钟南山表示，我们第一批疫苗要公布了，第一款、第二款很快要推出，很快就在中国要接种。【沈阳宣布进入战时状态 涉及小区居民核酸检测】12月23日沈阳市疫情防控指挥部发布通告，通报全市发现一例韩国返沈人员解除隔离后核酸检测阳性的情况",
    "title": "全球疫情动态「12月23日」：确诊病例突破7817万 美国政府加购1亿剂辉瑞疫苗",
    "label": "时政",
    "id": 7155
}]